app/controllers/registrations_controller.rb

	def new
		@roles = Role.all
---
SELECT `roles`.* FROM `roles`

	def create
		@user = User.new(params[:user])
		set_pwd(@user)
		if @user.save
			UserMailer.notify_user(@user).deliver
			flash[:notice] = "Successfully created user"
			redirect_to root_path
		else
			@roles = Role.all
---
INSERT INTO `users` (`created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `last_sign_in_at`, `last_sign_in_ip`, `name`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `role_id`, `sign_in_count`, `updated_at`) VALUES ('2014-05-28 09:58:45', NULL, NULL, 'abcdef@mail.com', '$2a$10$Gy27yOqm9PbQkMQJiMFH7.TlvxLh6fKNs.FQvFGQAnu6mjOqMhYzK', NULL, NULL, 'asdad', NULL, NULL, NULL, 1, 0, '2014-05-28 09:58:45')
SELECT `roles`.* FROM `roles`